"use client"
import React, { useEffect, useRef } from "react";
import { gsap } from "gsap";
import { useGSAP } from "@gsap/react";

const OtherText = () => {
  const containerRef = useRef(null);

  useGSAP(() => {
    const ctx = gsap.context(() => {
      gsap.from(".fade-item", {
        opacity: 0,
        y: 40,
        duration: 0.8,
        ease: "power3.out",
        stagger: 0.15,
      });
    }, containerRef);

    return () => ctx.revert();
  });

  const paragraphs = [
    "منم کوروش، شاه جهان، شاه بزرگ، شاه نیرومند، شاه بابل، شاه سومر و اَکد، شاه چهارگوشهٔ جهان.",
    "پسر کمبوجیه، شاه بزرگ، شاه شهر انشان، نوهٔ کوروش، شاه بزرگ، شاه شهر انشان، نوادهٔ چیش‌پش، شاه بزرگ، شاه شهر انشان",
    "دودمان جاودانهٔ پادشاهی، که خدایان بِل و نَبو فرمانرواییش را دوست می‌دارند و پادشاهی او را با دلی شاد یاد می‌کنند.",
    "   آنگاه که با آشتی به درون بابل درآمدم، جایگاه سروری خود را با جشن و شادمانی در کاخ شاهی برپا کردم. مردوک، سرور بزرگ، قلب گشادهٔ کسی که بابل را دوست دارد، همچون سرنوشتم به من بخشید و من هر روز ترسان در",
    "سپاهیان گسترده‌ام با آرامش درون بابل گام برمی‌داشتند. نگذاشتم کسی در همهٔ سومر و اَکد هراس‌آفرین باشد.",
    "در پیِ امنیت شهر بابل و همهٔ جایگاه‌های مقدسش بودم. برای مردم بابل که برخلاف خواست خدایان یوغی بر آنان نهاده بود که شایسته‌شان نبود",
    " خستگی‌هایشان را تسکین دادم (و) از بندها رهایشان کردم. مردوک، سرور بزرگ، از رفتار [نیک من] شادمان گشت",
    "به من کوروش، شاهی که از او می‌ترسد و کمبوجیه پسر تنی [ام و به] همهٔ سپاهیانم،",
    "برکتی نیکو ارزانی داشت، تا با آرامش، شادمانه در حضورش باشم. به [فرمان] والایش، همهٔ شاهانی که بر تخت‌ها نشسته‌اند",
    " از هر گوشهٔ (جهان)، از دریای بالا تا دریای پایین، آنان که در [سرزمین‌های دوردست] می‌زیند، (و) شاهان سرزمین اَمورّو که در چادرها زندگی می‌کنند، همهٔ آنان،",
    "  باج سنگینشان را به بابل آوردند و بر پاهایم بوسه زدند. از [شواَنّهَ] (=بابل) تا شهر آشور و شوش،",
    " اَکد، سرزمین اِشنونهَ، شهر زَمبَن، شهر مِتورنو، دِر، تا مرز گوتی، جایگاه[های مقدس آنسو] ی دجله که از دیرباز محراب‌هایشان ویران شده بود،",
    " خدایانی را که درون آن‌ها ساکن بودند، به جایگاه‌هایشان بازگرداندم و (آنان را) در جایگاه‌های ابدی خودشان نهادم. همهٔ مردمانِ آنان (=آن خدایان) را گردآوردم و به سکونتگاه‌هایشان بازگرداندم",
    "و خدایان سرزمین سومر و اَکد را که نبونئید – در میان خشم سرور خدایان- به بابل آورده بود، به فرمان مردوک، سرور بزرگ، به سلامت",
    "به جایگاه‌هایشان بازگرداندم، جایگاهی که دلشادشان می‌سازد. باشد تا همهٔ خدایانی که به درون نیایشگاه‌هایشان بازگرداندم،",
    "هر روز در برابر (خدایان) بِل و نبو، روزگاری دراز (=عمری طولانی) برایم خواستا شوند (و) کارهای نیکم را یادآور شوند و به مردوک، سرورم، چنین گویند که «کوروش، شاهی که از تو می‌ترسد و کمبوجیه پسرش»",
    "(باشد که) آنان تا روزگاران دراز ، سهمیه‌دهندگان نیایشگاه‌هایمان باشند و (باشد که) مردمان بابل شاهیِ مرا [بستایند]. من همهٔ سرزمین‌ها را در صلح (امنیت) نشاندم.",
 
  ];

  return (
    <div
      ref={containerRef}
      className="bg-gradient-to-br from-[#A77F60] to-[#9A8678] h-[140vh]  sm:block lg:hidden"
    >
      <h1 className="p-5 text-2xl text-center border-y-4 border-black bg-gradient-to-r from-[#A77F60] to-[#9A8678]">
        بخشی از متن استوانه کورش (سطر ۲۰ تا ۳۶)
      </h1>
      <div className="max-w-3xl mx-auto my-10 mx-4 bg-white/80 backdrop-blur-md shadow-xl overflow-hidden rounded-2xl">
        {/* Header */}

        {/* Content */}
        <div className="p-6 space-y-2 leading-8">
          {paragraphs.map((text, index) => (
            <p
              key={index}
              className="fade-item text-center text-gray-800 text-xs sm:text-base KharazmFont"
            >
              {text}
            </p>
          ))}
        </div>
      </div>
    </div>
  );
};

export default OtherText;