
import NeonCylinder from "../assets/Neon_Cylinder.webp";
import Shahbaz from "../assets/2درفش-شهباز.webp";
import Aeen from "../assets/aeen.webp";
import Her from "../assets/Herodotos.jpg";
import Will from "../assets/willDorant.jpg";
import Lamb from "../assets/lamb.jpg";

export const events = [
  {
    year: "حدود ۶۰۰ پ.م.",
    title: "تولد یک فرمانروا",
    text: "فرزندی به دنیا آمد پدر پادشاه قبیله پارس (کمبوجیه اول) و مادر دختر پادشاه ماد (ماندانا) ؛ آستیاگ بخواب دید که فرزندی که دخترش به دنیا آورده پادشاهی او را از بین میبرد پس به فرمانده خود (هارپاگ) دستور می دهد فرزند تازه به دنیا آمده  را ببرد و بکشد ؛ اما فرمانده نتوانست کودک را بکشد پس او را به یه کشاورز سپرد اما این پایان داستان نبود ...",
  },
  {
    year: "حدود ۵۹۰ پ.م.",
    title: "خردسالی",
    text: "کودک که در آن اهالی بیشتر از یه کودک کشاورز دیده میشد توجه های زیادی را جلب کرد و این موضوع حتی به دربار ماد رسید و آستیاگ بعد از اینکه فهمید فرزند دخترش کشته نشده فرمانده خود را مجازات کرد ؛وقتی که دریافت این کودک خطری ندارد و قصد ندارد پادشاهی او را از بین ببرد و او را به نزد پدر و مادر خود برد",
  },
  {
    year: "حدود ۵۵۹ پ.م.",
    title: "پادشاهی در انشان",
    text: "کودک وارد دربار پارسیان شد و رشد و نمود کرد به طوری که اعتماد بزرگان قبیله پارسیان را جلب کرد و در زمانی که پدرش از دنیا رفت بر تخت پادشاهی پارس نشست و اینگونه بود شروع حکومت کورش دوم",
  },
  {
    year: "حدود ۵۵۰ پ.م.",
    title: "پایان فرمانروایی ماد",
    text: "ماد ها به ضعف خود رسیده بودند و حکومت آنها رو به افول بود و در همین زمان کورش برخاست برای اینکه پارس را از یوغ ماد بیرون بیاورد پس به ماد ها حمله کرد آستیاگ هارپاگ را فرستاد برای جنگ ولی به دلیل اینکه هارپاگ از پادشاه کینه در دل داشت در میانه جنگ دست کشید؛ کورش وارد ماد شد آستیاگ که به اسارت او در آمده بود توسط کورش به هیرکانیا تبعید شد کورش ماد ها را از بین نبرد بلکه از آنان استفاده کرد و شاهنشاهی هخامنشی را بنیان گذاری کرد (هخامنشیان بر گرفته از اسم هخامنش اولین پادشاه پارس)",
  },
  {
    year: "حدود ۵۴۶ پ.م.",
    title: "سقوط لیدیه",
    text: "پس از سقوط ماد ها و قدرت گرفتن هخامنشیان کرزوس پادشاه لیدیه برای اینکه مرز سرزمین خود را گسترده تر کند و سلسله تازه تاسیس خطری برای آنها نباشد تصمیم به حمله گرفت اما پیش از اینکه بتواند جنگ را آغاز کند کورش از قصد وی با خبر شد و پیش دستی کرد و به سمت لیدیه حمله کرد و پس از نبرد هایی کرزوس شکست میخورد همانند آستیاگ تبعید میشود؛کورش لیدیه و سارد را به قلمرو پادشاهی خود اضافه میکند",
  },
  {
    year: "۵۳۹ پ.م.",
    title: "بابل",
    text: "نبونعید آخرین پادشاه بابل ؛ پادشاهی که مردمش را مورد ظلم قرار میداد و از دستورات مردوک (خدای بابلی ها) تبعیت نمیکرد که باعث خشم کاهنان شده بود بابلی ها به تنگنا آمده بودند و از پادشاه ناراضی بودند آنها آوازه کورش را شنیده بودند کاهنان او را نماینده مردوک میخوانند کورش بدون خونریزی وارد بابل می شود و مورد استقبال مردمش قرار میگیرد. سنت‌های محلی را محترم می‌شمارد و در سالنامه نبونعید از ورود کورش به بابل روایت شده",
  },
  {
    year: "حدود ۵۳۰ پ.م.",
    title: "پایان زندگی",
    text: "کورش درمی‌گذرد. آرامگاه او در پاسارگاد، پایتخت هخامنشیان، برجاست.",
  },
];

export const legacy = [
  {
    id: 1,
    title: "منشور حقوق بشر",
    desc: "یکی از مهم‌ترین دستاوردهای کورش، منشور حقوق بشر اوست که پس از فتح بابل در سال 539 قبل از میلاد منتشر شد. این منشور به آزادی مذهبی و حقوق انسانی اشاره داشت.",
    image: NeonCylinder,
  },
  {
    id: 2,
    title: "پایه‌گذاری نخستین امپراتوری جهانی",
    desc: "کورش با متحد ساختن مادها و پارس‌ها و سپس فتح لیدیه و بابل، بزرگ‌ترین امپراتوری یکپارچه جهان تا آن زمان را بنیان نهاد؛ الگویی برای حکومت‌های بعدی.",
    image: Shahbaz,
  },
  {
    id: 3,
    title: "احترام به فرهنگ‌های مغلوب",
    desc: "بر خلاف فاتحان پیشین، او معابد ویران‌شده را بازسازی می‌کرد، خدایان ملل دیگر را محترم می‌شمرد و به اقوام گوناگون اجازه می‌داد آداب و قوانین خود را حفظ کنند. نمونه بارز آن، آزادی یهودیان از اسارت بابِل و کمک به بازسازی معبد اورشلیم است",
    image: Aeen,
  },
  
];

export const respectData = [
    {
      id: 1,
      name: "هرودوت",
      job: "نویسنده و جغرافی‌دان یونان باستان",
      photo: Her,
      comment:
        "هیچ پارسی یافت نمی شد که بتواند خود را با کورش مقایسه کند. از اینرو من کتابم را درباره ایران و یونان نوشتم تا کردارهای شگفت انگیز و بزرگ این دو ملت عظیم هیچگاه به فراموشی سپرده نشود",
    },
    {
      id: 2,
      name: "هارولد لمب",
      job: "داستان‌نویس، تاریخ‌دان و نمایشنامه‌نویس آمریکایی",
      photo: Lamb,
      comment:
        "مهمترین صفت کورش دین داری او بود. او هر روز قربانیان برای ستایش خداوند می کرد. این رسوم و دینداری آنان هنوز در زمان اردشیر دوم هم وجود دارد و عمل می شود. از صفت های برجسته دیگر کورش عدل و گسترش عدالت و حق بود. ما در این باره فکر کردیم که چرا کورش به این اندازه برای فرانروایی عادل مردمان ساخته شده بود. سه دلیل را برایش پیدا کردیم. نخست نژاد اصیل آریایی او و بعد استعداد طبیعی و سپس نبوغ پروش او از کودکی بوده است",
    },
    {
      id: 3,
      name: "ویل دورانت",
      job: "فیلسوف و تاریخ‌نگار آمریکایی",
      photo: Will,
      comment:
        "کورش از افرادی بوده که برای فرمانروایی آفریده شده بود. به گفته امرسون همه از وجود او شاد بودند. روش او در کشور گشایی حیرت انگیز بود. او با شکست خوردگان با جوانمردی و بزرگواری برخورد می نمود. بهمین دلیل یونانیان که دشمن ایران بودند نتوانستد از آن بگذرند و درباره او داستانهای بیشماری نوشته اند و او را بزرگترین جهان قهرمان پیش از اسکندر می نامند. او کرزوس را پس از شکست از سوختن در میان هیزم های آتش نجات داد و بزرگش داشت و او را مشاور خود ساخت و یهودیان در بند را آزاد نمود. کورش سرداری بود که بیش از هر پادشاه دیگری در آن زمان محبوبیت داشت و پایه های شاهنشاهی اش را بر سخاوت و جوانمردی بنیان گذاشت",
    },
  ];