import Chapter from "../assets/chapter.webp";
import Flag from "../assets/flag.webp";
import Map from "../assets/map.webp";
import Aeen from "../assets/aeen.webp";
import Aff from "../assets/aflatoon.jpg";
import Xen from "../assets/Xenophon.jpg";
import Will from "../assets/willDorant.jpg";
import { StaticImageData } from "next/image";
export const legacyData = [
  {
    id: 1,
    title: "منشور حقوق بشر (استوانه کورش)",
    description:
      "اولین اعلامیه شناخته‌شده درباره آزادی دینی، لغو برده‌داری و حق بازگشت تبعیدیان به سرزمین‌شان. این سند از سوی سازمان ملل به عنوان بیانیه‌ای پیشرو در تاریخ حقوق بشر شناخته می‌شود.",
    image: Chapter,
  },
  {
    id: 2,
    title: "نظام اداری ساتراپی (شهربانی)",
    description:
      "کورش با تقسیم قلمرو پهناور به استان‌های خودمختار نسبی (ساتراپی‌ها) و گماشتن فرمانداران مسئول، مدلی از مدیریت غیرمتمرکز اما متحد ایجاد کرد که الهام‌بخش بسیاری از نظام‌های حکومتی پس از خود شد.",
    image: Map,
  },
  {
    id: 3,
    title: "پایه‌گذاری نخستین امپراتوری جهانی",
    description:
      "کورش با متحد ساختن مادها و پارس‌ها و سپس فتح لیدیه و بابل، بزرگ‌ترین امپراتوری یکپارچه جهان تا آن زمان را بنیان نهاد؛ الگویی برای حکومت‌های بعدی.",
    image: Flag,
  },
  {
    id: 4,
    title: "احترام به فرهنگ‌های مغلوب",
    description:
      "بر خلاف فاتحان پیشین، او معابد ویران‌شده را بازسازی می‌کرد، خدایان ملل دیگر را محترم می‌شمرد و به اقوام گوناگون اجازه می‌داد آداب و قوانین خود را حفظ کنند. نمونه بارز آن، آزادی یهودیان از اسارت بابِل و کمک به بازسازی معبد اورشلیم است.",
    image: Aeen,
  },
];
// data/datas.ts
export interface RespectItem {
  id: number;
  name: string;
  job: string;
    photo: string | StaticImageData;
  comment: string;
}


export const respectData: RespectItem[] = [
  {
    id: 1,
    name: "افلاطون",
    job: "فیلسوف برجسته ی یونان باستان",
    photo: Aff,
    comment:
      "پارسیان در زمان شاهنشاهی کورش اندازه میان بردگی و آزادگی را نگاه می داشتند. از اینرو نخست خود آزاد شدند و سپس سرور بسیاری از ملتهای جهان شدند. در زمان او (کورش بزرگ) فرمانروایان به زیر دستان خود آزادی میدادند و آنان را به رعایت قوانین انسان دوستانه و برابری ها راهنمایی می کردند. مردمان رابطه خوبی با پادشاهان خود داشتند از این رو در موقع خطر به یاری آنان می شتافتند و در جنگ ها شرکت می کردند. از این رو شاهنشاه در راس سپاه آنان را همراهی می کرد و به آنان اندرز می داد. آزادی و مهرورزی و رعایت حقوق مختلف اجتماعی به زیبایی انجام می گرفت.",
  },
  {
    id: 2,
    name: "گزنفون",
    job: "فیلسوف، مورخ، و سرباز یونانی",
    photo: Xen,
    comment:
      "مهمترین صفت کورش دین داری او بود. او هر روز قربانیان برای ستایش خداوند می کرد. این رسوم و دینداری آنان هنوز در زمان اردشیر دوم هم وجود دارد و عمل می شود. از صفت های برجسته دیگر کورش عدل و گسترش عدالت و حق بود. ما در این باره فکر کردیم که چرا کورش به این اندازه برای فرانروایی عادل مردمان ساخته شده بود. سه دلیل را برایش پیدا کردیم. نخست نژاد اصیل آریایی او و بعد استعداد طبیعی و سپس نبوغ پروش او از کودکی بوده است.",
  },
  {
     id: 3,
    name: "ویل دورانت",
    job: "فیلسوف و تاریخ‌نگار آمریکایی",
    photo: Will,
    comment:"کورش از افرادی بوده که برای فرمانروایی آفریده شده بود. به گفته امرسون همه از وجود او شاد بودند. روش او در کشور گشایی حیرت انگیز بود. او با شکست خوردگان با جوانمردی و بزرگواری برخورد می نمود. بهمین دلیل یونانیان که دشمن ایران بودند نتوانستد از آن بگذرند و درباره او داستانهای بیشماری نوشته اند و او را بزرگترین جهان قهرمان پیش از اسکندر می نامند. او کرزوس را پس از شکست از سوختن در میان هیزم های آتش نجات داد و بزرگش داشت و او را مشاور خود ساخت و یهودیان در بند را آزاد نمود. کورش سرداری بود که بیش از هر پادشاه دیگری در آن زمان محبوبیت داشت و پایه های شاهنشاهی اش را بر سخاوت و جوانمردی بنیان گذاشت."
  }
];
